Aghosh993/Athena/arch/tivaware_tm4c/driverlib/pin_map.h
#define GPIO_PM3_T3CCP1         0x000B0C03
#define GPIO_PM3_EPI0S12        0x000B0C0F

#define GPIO_PM4_U0CTS          0x000B1001
#define GPIO_PM4_T4CCP0         0x000B1003

#define GPIO_PM5_U0DCD          0x000B1401
#define GPIO_PM5_T4CCP1         0x000B1403

#define GPIO_PM6_U0DSR          0x000B1801
#define GPIO_PM6_T5CCP0         0x000B1803

#define GPIO_PM7_U0RI           0x000B1C01
#define GPIO_PM7_T5CCP1         0x000B1C03

#define GPIO_PN0_U1RTS          0x000C0001

#define GPIO_PN1_U1CTS          0x000C0401

#define GPIO_PN2_U1DCD          0x000C0801
#define GPIO_PN2_U2RTS          0x000C0802
#define GPIO_PN2_EPI0S29        0x000C080F

#define GPIO_PN3_U1DSR          0x000C0C01
#define GPIO_PN3_U2CTS          0x000C0C02
#define GPIO_PN3_EPI0S30        0x000C0C0F

#define GPIO_PN4_U1DTR          0x000C1001
#define GPIO_PN4_U3RTS          0x000C1002
#define GPIO_PN4_I2C2SDA        0x000C1003
#define GPIO_PN4_EPI0S34        0x000C100F

#define GPIO_PN5_U1RI           0x000C1401
#define GPIO_PN5_U3CTS          0x000C1402
#define GPIO_PN5_I2C2SCL        0x000C1403
#define GPIO_PN5_EPI0S35        0x000C140F

#define GPIO_PN6_U4RTS          0x000C1802
#define GPIO_PN6_LCDDATA13      0x000C180F

#define GPIO_PN7_U1RTS          0x000C1C01
#define GPIO_PN7_U4CTS          0x000C1C02
#define GPIO_PN7_LCDDATA12      0x000C1C0F

#define GPIO_PP0_U6RX           0x000D0001
#define GPIO_PP0_T6CCP0         0x000D0005
#define GPIO_PP0_SSI3XDAT2      0x000D000F

#define GPIO_PP1_U6TX           0x000D0401
#define GPIO_PP1_T6CCP1         0x000D0405
#define GPIO_PP1_SSI3XDAT3      0x000D040F

#define GPIO_PP2_U0DTR          0x000D0801
#define GPIO_PP2_USB0NXT        0x000D080E
#define GPIO_PP2_EPI0S29        0x000D080F

#define GPIO_PP3_U1CTS          0x000D0C01
#define GPIO_PP3_U0DCD          0x000D0C02
#define GPIO_PP3_RTCCLK         0x000D0C07
#define GPIO_PP3_USB0DIR        0x000D0C0E
#define GPIO_PP3_EPI0S30        0x000D0C0F

#define GPIO_PP4_U3RTS          0x000D1001
#define GPIO_PP4_U0DSR          0x000D1002
#define GPIO_PP4_USB0D7         0x000D100E

#define GPIO_PP5_U3CTS          0x000D1401
#define GPIO_PP5_I2C2SCL        0x000D1402
#define GPIO_PP5_USB0D6         0x000D140E

#define GPIO_PP6_U1DCD          0x000D1801
#define GPIO_PP6_I2C2SDA        0x000D1802

#define GPIO_PQ0_T6CCP0         0x000E0003
#define GPIO_PQ0_SSI3CLK        0x000E000E
#define GPIO_PQ0_EPI0S20        0x000E000F

#define GPIO_PQ1_T6CCP1         0x000E0403
#define GPIO_PQ1_SSI3FSS        0x000E040E
#define GPIO_PQ1_EPI0S21        0x000E040F

#define GPIO_PQ2_T7CCP0         0x000E0803
#define GPIO_PQ2_SSI3XDAT0      0x000E080E
#define GPIO_PQ2_EPI0S22        0x000E080F

#define GPIO_PQ3_T7CCP1         0x000E0C03
#define GPIO_PQ3_SSI3XDAT1      0x000E0C0E
#define GPIO_PQ3_EPI0S23        0x000E0C0F

#define GPIO_PQ4_U1RX           0x000E1001
#define GPIO_PQ4_DIVSCLK        0x000E1007

#define GPIO_PQ5_U1TX           0x000E1401

#define GPIO_PQ6_U1DTR          0x000E1801

#define GPIO_PQ7_U1RI           0x000E1C01

#define GPIO_PR0_U4TX           0x000F0001
#define GPIO_PR0_I2C1SCL        0x000F0002
#define GPIO_PR0_M0PWM0         0x000F0006
#define GPIO_PR0_LCDCP          0x000F000F

#define GPIO_PR1_U4RX           0x000F0401
#define GPIO_PR1_I2C1SDA        0x000F0402
#define GPIO_PR1_M0PWM1         0x000F0406
#define GPIO_PR1_LCDFP          0x000F040F

#define GPIO_PR2_I2C2SCL        0x000F0802
#define GPIO_PR2_M0PWM2         0x000F0806
#define GPIO_PR2_LCDLP          0x000F080F

#define GPIO_PR3_I2C2SDA        0x000F0C02
#define GPIO_PR3_M0PWM3         0x000F0C06
#define GPIO_PR3_LCDDATA03      0x000F0C0F

#define GPIO_PR4_I2C3SCL        0x000F1002
#define GPIO_PR4_T0CCP0         0x000F1003
#define GPIO_PR4_M0PWM4         0x000F1006
#define GPIO_PR4_LCDDATA00      0x000F100F

#define GPIO_PR5_U1RX           0x000F1401
#define GPIO_PR5_I2C3SDA        0x000F1402
#define GPIO_PR5_T0CCP1         0x000F1403
#define GPIO_PR5_M0PWM5         0x000F1406
#define GPIO_PR5_LCDDATA01      0x000F140F

#define GPIO_PR6_U1TX           0x000F1801
#define GPIO_PR6_I2C4SCL        0x000F1802
#define GPIO_PR6_T1CCP0         0x000F1803
#define GPIO_PR6_M0PWM6         0x000F1806
#define GPIO_PR6_LCDDATA04      0x000F180F

#define GPIO_PR7_I2C4SDA        0x000F1C02
#define GPIO_PR7_T1CCP1         0x000F1C03
#define GPIO_PR7_M0PWM7         0x000F1C06
#define GPIO_PR7_LCDDATA05      0x000F1C0F

#define GPIO_PS0_T2CCP0         0x00100003
#define GPIO_PS0_M0FAULT0       0x00100006
#define GPIO_PS0_LCDDATA20      0x0010000F

#define GPIO_PS1_T2CCP1         0x00100403
#define GPIO_PS1_M0FAULT1       0x00100406
#define GPIO_PS1_LCDDATA21      0x0010040F

#define GPIO_PS2_U1DSR          0x00100801
#define GPIO_PS2_T3CCP0         0x00100803
#define GPIO_PS2_M0FAULT2       0x00100806
#define GPIO_PS2_LCDDATA22      0x0010080F

#define GPIO_PS3_T3CCP1         0x00100C03
#define GPIO_PS3_M0FAULT3       0x00100C06
#define GPIO_PS3_LCDDATA23      0x00100C0F

#define GPIO_PS4_T4CCP0         0x00101003
#define GPIO_PS4_PHA0           0x00101006
#define GPIO_PS4_LCDDATA06      0x0010100F

#define GPIO_PS5_T4CCP1         0x00101403
#define GPIO_PS5_PHB0           0x00101406
#define GPIO_PS5_LCDDATA07      0x0010140F

#define GPIO_PS6_T5CCP0         0x00101803
#define GPIO_PS6_IDX0           0x00101806
#define GPIO_PS6_LCDDATA08      0x0010180F

#define GPIO_PS7_T5CCP1         0x00101C03
#define GPIO_PS7_LCDDATA09      0x00101C0F

#define GPIO_PT0_T6CCP0         0x00110003
#define GPIO_PT0_CAN0RX         0x00110007
#define GPIO_PT0_LCDDATA10      0x0011000F

#define GPIO_PT1_T6CCP1         0x00110403
#define GPIO_PT1_CAN0TX         0x00110407
#define GPIO_PT1_LCDDATA11      0x0011040F

#define GPIO_PT2_T7CCP0         0x00110803
#define GPIO_PT2_CAN1RX         0x00110807
#define GPIO_PT2_LCDDATA18      0x0011080F

